package lesson35;

import java.util.*;

public class task2 {
//    Задача 2:
//    Пользователь вводит строку с клавиатуры. Для каждого слова подсчитать частоту его
//    встречаемости. Слова, отличающиеся регистром букв считать разными. Использовать
//    класс HashMap. После выполнения результат вывести в консоль.

    public static void main(String[] args) {
//        Scanner sc = new Scanner(System.in);
//        System.out.println("Введите строку: ");
//        String line = sc.nextLine();
//        List<String> lines = List.of(line.split(" "));
//        Map<String, Integer> words = new HashMap<>();
//        for(String lin: lines)
//            if(words.containsKey(lin))
//                words.put(lin, words.get(lin)+1);
//            else
//                words.put(lin, 1);
//        System.out.println(words);
        //qwe qwe hu qwe hu sfgt msldf ncsi qwe pds sp
    }
}


